renesas/trusted-firmware-m/platform/ext/target/renesas/ra6m4/Native_Driver/r_flash_hp.c
/* ${REA_DISCLAIMER_PLACEHOLDER} */

/***********************************************************************************************************************
 * Includes
 **********************************************************************************************************************/
#include "bsp_api.h"
#include <string.h>
#include "r_flash_hp.h"

/* Configuration for this package. */
#include "r_flash_hp_cfg.h"

/***********************************************************************************************************************
 * Typedef definitions
 **********************************************************************************************************************/

/***********************************************************************************************************************
 * Macro definitions
 **********************************************************************************************************************/
    #define BSP_ROM_SIZE_BYTES              (1048576)
    #define BSP_RAM_SIZE_BYTES              (262144)
    #define BSP_DATA_FLASH_SIZE_BYTES       (32768)
#define FLASH_HP_FENTRYR_PE_MODE_BITS                   (0x0081U)
#define FLASH_HP_FSTATR_FLWEERR                         (1U << 6U)
#define FLASH_HP_FSTATR_PRGERR                          (1U << 12U)
#define FLASH_HP_FSTATR_ERSERR                          (1U << 13U)
#define FLASH_HP_FSTATR_ILGLERR                         (1U << 14U)
#define FLASH_HP_FSTATR_OTERR                           (1U << 20U)
#define FLASH_HP_FSTATR_SECERR                          (1U << 21U)
#define FLASH_HP_FSTATR_FESETERR                        (1U << 22U)
#define FLASH_HP_FSTATR_ILGCOMERR                       (1U << 23U)

#define FLASH_HP_FSTATR_ERROR_MASK                      (FLASH_HP_FSTATR_FLWEERR | FLASH_HP_FSTATR_PRGERR | \
                                                         FLASH_HP_FSTATR_ERSERR |                           \
                                                         FLASH_HP_FSTATR_ILGLERR | FLASH_HP_FSTATR_OTERR |  \
                                                         FLASH_HP_FSTATR_SECERR |                           \
                                                         FLASH_HP_FSTATR_FESETERR | FLASH_HP_FSTATR_ILGCOMERR)

/** "OPEN" in ASCII, used to avoid multiple open. */
#define FLASH_HP_OPEN                                   (0x4f50454eU)
#define FLASH_HP_CLOSE                                  (0U)

/* Minimum FCLK for Flash Operations in Hz */
#define FLASH_HP_MINIMUM_SUPPORTED_FCLK_FREQ            (4000000U)

/* Smallest Code Flash block size */
#define FLASH_HP_CODE_SMALL_BLOCK_SZ                    (8192U)

/* Largest Code Flash block size */
#define FLASH_HP_CODE_LARGE_BLOCK_SZ                    (32768U)

#define FLASH_HP_DATA_BLOCK_SIZE                        (64U)

/** The maximum timeout for commands is 100usec when FCLK is 16 MHz i.e. 1600 FCLK cycles.
 * Assuming worst case of ICLK at 240 MHz and FCLK at 4 MHz, and optimization set to max such that
 * each count decrement loop takes only 5 cycles, then ((240/4)*1600)/5 = 19200 */
#define FLASH_HP_FRDY_CMD_TIMEOUT                       (19200)

/** Time that it would take for the Data Buffer to be empty (DBFULL Flag) is 90 FCLK cycles.
 * Assuming worst case of ICLK at 240 MHz and FCLK at 4 MHz, and optimization set to max such that
 * each count decrement loop takes only 5 cycles, then ((240/4)*90)/5 = 1080 */
#define FLASH_HP_DBFULL_TIMEOUT                         (1080U)

/** R_FACI Commands */
#define FLASH_HP_FACI_CMD_PROGRAM                       (0xE8U)
#define FLASH_HP_FACI_CMD_PROGRAM_CF                    (0x80U)
#define FLASH_HP_FACI_CMD_PROGRAM_DF                    (0x02U)
#define FLASH_HP_FACI_CMD_BLOCK_ERASE                   (0x20U)
#define FLASH_HP_FACI_CMD_PE_SUSPEND                    (0xB0U)
#define FLASH_HP_FACI_CMD_PE_RESUME                     (0xD0U)
#define FLASH_HP_FACI_CMD_STATUS_CLEAR                  (0x50U)
#define FLASH_HP_FACI_CMD_FORCED_STOP                   (0xB3U)
#define FLASH_HP_FACI_CMD_BLANK_CHECK                   (0x71U)
#define FLASH_HP_FACI_CMD_CONFIG_SET_1                  (0x40U)
#define FLASH_HP_FACI_CMD_CONFIG_SET_2                  (0x08U)
#define FLASH_HP_FACI_CMD_LOCK_BIT_PGM                  (0x77U)
#define FLASH_HP_FACI_CMD_LOCK_BIT_READ                 (0x71U)
#define FLASH_HP_FACI_CMD_FINAL                         (0xD0U)

/**  Configuration set Command offset*/
#define FLASH_HP_FCU_CONFIG_SET_ID_BYTE                 (0x0000A150U)
#ifndef BSP_MCU_GROUP_RA6M4
 #define FLASH_HP_FCU_CONFIG_SET_ACCESS_STARTUP         (0x0000A160U)
#else
 #define FLASH_HP_FCU_CONFIG_SET_ACCESS_STARTUP         (0x0100A130U)
#endif

/* Zero based offset into g_configuration_area_data[] for FAWS */
#define FLASH_HP_FCU_CONFIG_SET_FAWS_OFFSET             (2U)

/* Zero based offset into g_configuration_area_data[] for FAWE and BTFLG */
#define FLASH_HP_FCU_CONFIG_SET_FAWE_BTFLG_OFFSET       (3U)

/* These bits must always be set when writing to the configuration area. */
#define FLASH_HP_FCU_CONFIG_FAWE_BTFLG_UNUSED_BITS      (0x7800U)
#define FLASH_HP_FCU_CONFIG_FAWS_UNUSED_BITS            (0xF800U)

/* 8 words need to be written */
#define FLASH_HP_CONFIG_SET_ACCESS_WORD_CNT             (8U)

#define FLASH_HP_FSUACR_KEY                             (0x6600U)

#define FLASH_HP_SAS_KEY                                (0x6600U)

/** Register masks */
#define FLASH_HP_FPESTAT_NON_LOCK_BIT_PGM_ERROR         (0x0002U) // Bits indicating Non Lock Bit related Programming error.
#define FLASH_HP_FPESTAT_NON_LOCK_BIT_ERASE_ERROR       (0x0012U) // Bits indicating Non Lock Bit related Erasure error.
#define FLASH_HP_FENTRYR_DF_PE_MODE                     (0x0080U) // Bits indicating that Data Flash is in P/E mode.
#define FLASH_HP_FENTRYR_CF_PE_MODE                     (0x0001U) // Bits indicating that CodeFlash is in P/E mode.
#define FLASH_HP_FENTRYR_TRANSITION_TO_CF_PE            (0xAA01U) // Key Code to transition to CF P/E mode.
#define FLASH_HP_FENTRYR_TRANSITION_TO_DF_PE            (0xAA80U) // Key Code to transition to DF P/E mode.

#define FLASH_HP_FREQUENCY_IN_HZ                        (1000000U)

#define FLASH_HP_FENTRYR_READ_MODE                      (0xAA00U)

#define FLASH_HP_FAEINT_DFAEIE                          (0x08)
#define FLASH_HP_FAEINT_CMDLKIE                         (0x10)
#define FLASH_HP_FAEINT_CFAEIE                          (0x80)
#define FLASH_HP_ERROR_INTERRUPTS_ENABLE                (FLASH_HP_FAEINT_DFAEIE | FLASH_HP_FAEINT_CMDLKIE | \
                                                         FLASH_HP_FAEINT_CFAEIE)

#define FLASH_HP_FPCKAR_KEY                             (0x1E00U)

#define FLASH_HP_MAX_WRITE_CF_US                        (15800)
#define FLASH_HP_MAX_WRITE_DF_US                        (3800)
#define FLASH_HP_MAX_DBFULL_US                          (2)
#define FLASH_HP_MAX_BLANK_CHECK_US                     (84)
#define FLASH_HP_MAX_WRITE_CONFIG_US                    (307000)
#define FLASH_HP_MAX_ERASE_DF_BLOCK_US                  (18000)
#define FLASH_HP_MAX_ERASE_CF_LARGE_BLOCK_US            (1040000)
#define FLASH_HP_MAX_ERASE_CF_SMALL_BLOCK_US            (260000)

#define FLASH_HP_FASTAT_DFAE                            (0x08)
#define FLASH_HP_FASTAT_CFAE                            (0x80)
#define FLASH_HP_FASTAT_CMDLK                           (0x10)

/* The number of CPU cycles per each timeout loop. */
#ifndef R_FLASH_HP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP
 #if defined(__GNUC__)
  #define R_FLASH_HP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP    (6U)
 #elif defined(__ICCARM__)
  #define R_FLASH_HP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP    (6U)
 #endif
#endif

#define FLASH_HP_REGISTER_WAIT_TIMEOUT(val, reg, timeout, err) \
    while (val != reg)                                         \
    {                                                          \
        if (0 == timeout)                                      \
        {                                                      \
            return err;                                        \
        }                                                      \
        timeout--;                                             \
    }

