renesas/trusted-firmware-m/platform/ext/target/renesas/ra6m4/Native_Driver/r_flash_hp.c
        /* Configure the configuration area to be written. */
        flash_hp_configuration_area_data_setup(~swap_type & 0x1, 0xFFFFFFFF, 0xFFFFFFFF);
 #else
        memset(g_configuration_area_data, 0xFF, sizeof(g_configuration_area_data));

        g_configuration_area_data[FLASH_HP_FCU_CONFIG_SET_FAWE_BTFLG_OFFSET] =
            (uint16_t) (((((uint16_t) ~swap_type) & 0x1U) << 15U) | 0x7FFFU);
 #endif

        /* Write the configuration area to the access/startup region. */
        err = flash_hp_configuration_area_write(p_ctrl, FLASH_HP_FCU_CONFIG_SET_ACCESS_STARTUP);

        err = flash_hp_check_errors(err, 0, FSP_ERR_WRITE_FAILED);
    }

    /* Return to read mode*/
    fsp_err_t pe_exit_err = flash_hp_pe_mode_exit();

    if (FSP_SUCCESS == err)
    {
        err = pe_exit_err;
    }

    return err;
}

#endif

#if (FLASH_HP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)

/*******************************************************************************************************************//**
 * Set the ID code.
 *
 * @param      p_ctrl                Pointer to the control block
 * @param      p_id_code             The identifier code
 * @param[in]  mode                  ID code mode
 *
 * @retval     FSP_SUCCESS           Set Configuration successful
 * @retval     FSP_ERR_PE_FAILURE    Failed to enter or exit Code Flash P/E mode.
 * @retval     FSP_ERR_TIMEOUT       Timed out waiting for the FCU to become ready.
 * @retval     FSP_ERR_WRITE_FAILED  Status is indicating a Programming error for the requested operation.
 * @retval     FSP_ERR_CMD_LOCKED    FCU is in locked state, typically as a result of having received an illegal
 *                                   command.
 **********************************************************************************************************************/
static fsp_err_t flash_hp_set_id_code (flash_hp_instance_ctrl_t * p_ctrl,
                                       uint8_t const * const      p_id_code,
                                       flash_id_code_mode_t       mode)
{
    uint32_t * temp      = (uint32_t *) p_id_code;
    uint32_t * temp_area = (uint32_t *) g_configuration_area_data;

    /* Update Flash state and enter the required P/E mode specified by the hardware manual. */
    fsp_err_t err = flash_hp_enter_pe_cf_mode(p_ctrl);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

    /* Configure the configuration area to be written. If the mode is unlocked write all 0xFF. */
    for (uint32_t index = 0U; index < 4U; index++)
    {
        if (FLASH_ID_CODE_MODE_UNLOCKED == mode)
        {
            temp_area[index] = UINT32_MAX;
        }
        else
        {
            temp_area[index] = temp[index];
        }
    }

    /* If the mode is not unlocked set bits 126 and 127 accordingly. */
    if (FLASH_ID_CODE_MODE_UNLOCKED != mode)
    {
        g_configuration_area_data[FLASH_HP_CONFIG_SET_ACCESS_WORD_CNT - 1U] |= (uint16_t) mode;
    }

    /* Write the configuration area to the access/startup region. */
    err = flash_hp_configuration_area_write(p_ctrl, FLASH_HP_FCU_CONFIG_SET_ID_BYTE);

    err = flash_hp_check_errors(err, 0, FSP_ERR_WRITE_FAILED);

    /* Return to read mode*/
    fsp_err_t pe_exit_err = flash_hp_pe_mode_exit();

    if (FSP_SUCCESS == err)
    {
        err = pe_exit_err;
    }

    return err;
}

#endif

#if (FLASH_HP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)

/*******************************************************************************************************************//**
 * Execute the Set Configuration sequence using the g_configuration_area_data structure set up the caller.
 *
 * @param      p_ctrl           Pointer to the control block
 * @param[in]  fsaddr           Flash address to be written to.
 *
 * @retval     FSP_SUCCESS      Set Configuration successful
 * @retval     FSP_ERR_TIMEOUT  Timed out waiting for the FCU to become ready.
 **********************************************************************************************************************/
static fsp_err_t flash_hp_configuration_area_write (flash_hp_instance_ctrl_t * p_ctrl, uint32_t fsaddr)
{
    volatile uint32_t timeout = p_ctrl->timeout_write_config;

    /* See "Configuration Set Command": Section 7.3.16 in SC32_FlashMemory_supplement(RV40F_Ph2)_20160204. */
    R_FACI_HP->FSADDR        = fsaddr;
    R_FACI_HP_CMD->FACI_CMD8 = FLASH_HP_FACI_CMD_CONFIG_SET_1;
    R_FACI_HP_CMD->FACI_CMD8 = FLASH_HP_FACI_CMD_CONFIG_SET_2;

    /* Write the configuration data. */
    for (uint32_t index = 0U; index < FLASH_HP_CONFIG_SET_ACCESS_WORD_CNT; index++)
    {
        /* There are 8 16 bit words that must be written to accomplish a configuration set */
        R_FACI_HP_CMD->FACI_CMD16 = g_configuration_area_data[index];
    }

    R_FACI_HP_CMD->FACI_CMD8 = FLASH_HP_FACI_CMD_FINAL;

    while (1U != R_FACI_HP->FSTATR_b.FRDY)
    {
        if (timeout <= 0U)
        {
            return FSP_ERR_TIMEOUT;
        }

        timeout--;
    }

    return FSP_SUCCESS;
}

#endif

/** If BGO is being used then we require both interrupts to be enabled (RDY and ERR). If either one
 *  is not enabled then don't generate any ISR routines */

/*******************************************************************************************************************//**
 * FLASH error interrupt routine.
 *
 * This function implements the FLASH error isr. The function clears the interrupt request source on entry populates the
 * callback structure with the FLASH_IRQ_EVENT_ERR_ECC event, and providing a callback routine has been provided, calls
 * the callback function with the event.
 **********************************************************************************************************************/
//void fcu_fiferr_isr (void)
//{
//    /* Save context if RTOS is used */
//    FSP_CONTEXT_SAVE
//    flash_callback_args_t cb_data;
//    IRQn_Type             irq = R_FSP_CurrentIrqGet();
//
//    flash_hp_instance_ctrl_t * p_ctrl = (flash_hp_instance_ctrl_t *) R_FSP_IsrContextGet(irq);
//
//    uint32_t fastat        = R_FACI_HP->FASTAT;
//    uint32_t fstatr_errors = R_FACI_HP->FSTATR & FLASH_HP_FSTATR_ERROR_MASK;
//
//    /* The flash access error interrupt register has fired. */
//    /* Check for the data flash memory access violation flag. */
//    if (fastat & FLASH_HP_FASTAT_DFAE)
//    {
//        cb_data.event = FLASH_EVENT_ERR_DF_ACCESS;
//    }
//    /* Check for the code flash memory access violation flag. */
//    else if (fastat & FLASH_HP_FASTAT_CFAE)
//    {
//        cb_data.event = FLASH_EVENT_ERR_CF_ACCESS;
//    }
//    /* Check if the command Lock bit is set. */
//    else if (fastat & FLASH_HP_FASTAT_CMDLK)
//    {
//        if (fstatr_errors & (FLASH_HP_FSTATR_PRGERR | FLASH_HP_FSTATR_ERSERR))
//        {
//            cb_data.event = FLASH_EVENT_ERR_FAILURE;
//        }
//        else
//        {
//            cb_data.event = FLASH_EVENT_ERR_CMD_LOCKED;
//        }
//    }
//    else
//    {
//        cb_data.event = FLASH_EVENT_ERR_FAILURE;
//    }
//
//    /* Reset the FCU: This will stop any existing processes and exit PE mode*/
//    flash_hp_reset(p_ctrl);
//
//    /* Clear the Error Interrupt. */
//    R_BSP_IrqStatusClear(irq);
//
//    /* Call the user callback. */
//    p_ctrl->p_cfg->p_callback(&cb_data);
//
//    /* Restore context if RTOS is used */
//    FSP_CONTEXT_RESTORE
//}
//
///*******************************************************************************************************************//**
// * FLASH ready interrupt routine.
// *
// * This function implements the FLASH ready isr. The function clears the interrupt request source on entry populates the
// * callback structure with the relevant event, and providing a callback routine has been provided, calls the callback
// * function with the event.
// **********************************************************************************************************************/
//void fcu_frdyi_isr (void)
//{
//    FSP_CONTEXT_SAVE
//    bool operation_completed = false;
//
//    /*Wait counter used for DBFULL flag*/
//    flash_callback_args_t cb_data;
//
//    IRQn_Type irq = R_FSP_CurrentIrqGet();
//
//    flash_hp_instance_ctrl_t * p_ctrl = (flash_hp_instance_ctrl_t *) R_FSP_IsrContextGet(irq);
//
//    /* Clear the Interrupt Request*/
//    R_BSP_IrqStatusClear(irq);
//
//    /* A reset of the FACI with a BGO operation in progress may still generate a single interrupt
//     * subsequent to the reset. We want to ignore that */
//
//    /* Continue the current operation. If unknown operation set callback event to failure. */
//    if (FLASH_OPERATION_DF_BGO_WRITE == p_ctrl->current_operation)
//    {
//        /* If there are still bytes to write */
//        if (p_ctrl->operations_remaining)
//        {
//            fsp_err_t err = flash_hp_write_data(p_ctrl, BSP_FEATURE_FLASH_HP_DF_WRITE_SIZE, 0);
//
//            if (FSP_SUCCESS != err)
//            {
//                flash_hp_reset(p_ctrl);
//                cb_data.event = FLASH_EVENT_ERR_FAILURE;
//            }
//        }
//        /*Done writing all bytes*/
//        else
//        {
//            cb_data.event       = FLASH_EVENT_WRITE_COMPLETE;
//            operation_completed = true;
//        }
//    }
//    else if ((FLASH_OPERATION_DF_BGO_ERASE == p_ctrl->current_operation))
//    {
//        if (p_ctrl->operations_remaining)
//        {
//            flash_hp_erase_block(p_ctrl, BSP_FEATURE_FLASH_HP_DF_BLOCK_SIZE, 0);
//        }
//        /* If all blocks are erased*/
//        else
//        {
//            cb_data.event       = FLASH_EVENT_ERASE_COMPLETE;
//            operation_completed = true;
//        }
//    }
//    else
//    {
//        /* Blank check is a single operation */
//        operation_completed = true;
//        if (R_FACI_HP->FBCSTAT == 0x01U)
//        {
//            cb_data.event = FLASH_EVENT_NOT_BLANK;
//        }
//        else
//        {
//            cb_data.event = FLASH_EVENT_BLANK;
//        }
//    }
//
//    /* If the current operation has completed exit pe mode, release the software lock and call the user callback if used. */
//    if (operation_completed == true)
//    {
//        /* finished current operation. Exit P/E mode*/
//        flash_hp_pe_mode_exit();
//
//        /* Release lock and Set current state to Idle*/
//        p_ctrl->current_operation = FLASH_OPERATION_NON_BGO;
//
//        /* Set data to identify callback to user, then call user callback. */
//        p_ctrl->p_cfg->p_callback(&cb_data);
//    }
//
//    FSP_CONTEXT_RESTORE
//}

/*******************************************************************************************************************//**
 * This function switches the peripheral to P/E mode for Data Flash.
 * @param[in]  p_ctrl              Pointer to the Flash control block.
 * @retval     FSP_SUCCESS         Successfully entered Data Flash P/E mode.
 * @retval     FSP_ERR_PE_FAILURE  Failed to enter Data Flash P/E mode.
 **********************************************************************************************************************/
static fsp_err_t flash_hp_enter_pe_df_mode (flash_hp_instance_ctrl_t * const p_ctrl)
{
    fsp_err_t err = FSP_SUCCESS;

    /* See "Transition to Data Flash P/E Mode": Section 7.3.4 in SC32_FlashMemory_supplement(RV40F_Ph2)_20160204. */
    /* Timeout counter. */
    volatile uint32_t wait_count = FLASH_HP_FRDY_CMD_TIMEOUT;

    /* If BGO mode is enabled and interrupts are being used then enable interrupts. */
//    if (p_ctrl->p_cfg->data_flash_bgo == true)
//    {
//        /* We are supporting Flash Rdy interrupts for Data Flash operations. */
//        R_BSP_IrqEnable(p_ctrl->p_cfg->irq);
//
//        /* We are supporting Flash Err interrupts for Data Flash operations. */
//        R_BSP_IrqEnable(p_ctrl->p_cfg->err_irq);
//    }

    /* Enter Data Flash PE mode. */
    R_FACI_HP->FENTRYR = FLASH_HP_FENTRYR_TRANSITION_TO_DF_PE;

    /* Wait for the operation to complete or timeout. If timeout return error. */
    /* Read FENTRYR until it has been set to 0x0080 indicating that we have successfully entered P/E mode.*/
    while (FLASH_HP_FENTRYR_DF_PE_MODE != R_FACI_HP->FENTRYR)
    {
        /* Wait until FENTRYR is 0x0080 unless timeout occurs. */
        if (wait_count == 0U)
        {

            /* if FENTRYR is not set after max timeout return an error. */
            return FSP_ERR_PE_FAILURE;
        }

